test/vcr_cassettes/test_create_charge_with_invalid_source_id.yml

---
http_interactions:
- request:
    method: post
    uri: https://sandbox-api.openpay.mx/v1/mxibgczgkhrnyyeg01kz/charges
    body:
      encoding: UTF-8
      string: '{"source_id":"kwoytmpdy3ctqlyooi5f","method":"card","amount":1000,"currency":"MXN","description":"Cargo
        inicial a mi cuenta","order_id":"666974727f7621ea602c9f29bb8490624e394cd9","device_session_id":"03QKX08AUPvoJyxY6PP0Xu9kC7Mabusw","customer":{"name":"Juan","last_name":"Vazquez
        Juarez","phone_number":4423456723,"email":"juan.vazquez@empresa.com.mx"}}'
    headers:
      Authorization:
      - Basic c2tfZTRkMmY2OTMwNjNiNGZiOGExNTNhYjRiN2E4MWQ1NDc6
      Content-Type:
      - application/json
      User-Agent:
      - Ruby - Openpay SDK v0.0.1
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 422
      message: ''
    headers:
      Date:
      - Sat, 03 Apr 2021 22:59:17 GMT
      Content-Type:
      - application/json;charset=UTF-8
      Content-Length:
      - '156'
      Connection:
      - keep-alive
      Openpay-Request-Id:
      - 6b39d201-bb94-465a-ae5e-3fbb9b61d7c1
      Cache-Control:
      - no-cache, no-store, max-age=0, must-revalidate
      Pragma:
      - no-cache
      Expires:
      - '0'
      Strict-Transport-Security:
      - max-age=31536000 ; includeSubDomains
      X-Xss-Protection:
      - 1; mode=block
      X-Frame-Options:
      - DENY
      X-Content-Type-Options:
      - nosniff
      Op-Error-Code:
      - '1003'
    body:
      encoding: UTF-8
      string: '{"http_code":422,"error_code":1003,"category":"request","description":"This
        source_id was already used","request_id":"6b39d201-bb94-465a-ae5e-3fbb9b61d7c1"}'
  recorded_at: Sat, 03 Apr 2021 22:59:17 GMT
recorded_with: VCR 6.0.0
